# AT2 - Retail dataset preperation for prediction and forecasting

# 1. Loading the dataset

## 1.1. Launch commands to automatically reload modules

In [1]:
%load_ext autoreload
%autoreload 2

## 1.2. Import the packages

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## 1.3. Load the training and test dataset into a dataframes called df_train and df_test

In [3]:
df_calendar = pd.read_csv('../data/raw/calendar.csv',low_memory=False)
df_cal_events = pd.read_csv('../data/raw/calendar_events.csv',low_memory=False)
df_week_sell_price = pd.read_csv('../data/raw/items_weekly_sell_prices.csv',low_memory=False)
df_train = pd.read_csv('../data/raw/sales_train.csv',low_memory=False)
df_test = pd.read_csv('../data/raw/sales_test.csv',low_memory=False)

# 2. Exploring the dataset

 ## 2.1 Installing the custom package with pip

In [4]:
! pip install -i https://test.pypi.org/simple/ my_krml_pine==2024.0.1.18

Looking in indexes: https://test.pypi.org/simple/
Requirement already satisfied: my_krml_pine==2024.0.1.9 in c:\users\paiyn\appdata\local\pypoetry\cache\virtualenvs\kaggle1-nbadraft-risgqe3a-py3.11\lib\site-packages (2024.0.1.9)
Requirement already satisfied: pandas==2.2.2 in c:\users\paiyn\appdata\local\pypoetry\cache\virtualenvs\kaggle1-nbadraft-risgqe3a-py3.11\lib\site-packages (from my_krml_pine==2024.0.1.9) (2.2.2)
Requirement already satisfied: scikit-learn==1.5.1 in c:\users\paiyn\appdata\local\pypoetry\cache\virtualenvs\kaggle1-nbadraft-risgqe3a-py3.11\lib\site-packages (from my_krml_pine==2024.0.1.9) (1.5.1)
Requirement already satisfied: numpy>=1.23.2 in c:\users\paiyn\appdata\local\pypoetry\cache\virtualenvs\kaggle1-nbadraft-risgqe3a-py3.11\lib\site-packages (from pandas==2.2.2->my_krml_pine==2024.0.1.9) (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\paiyn\appdata\local\pypoetry\cache\virtualenvs\kaggle1-nbadraft-risgqe3a-py3.11\lib\site-packages (from pandas==2.2.2->my_krml_pine==2024.0.1.9) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\paiyn\appdata\local\pypoetry\cache\virtualenvs\kaggle1-nbadraft-risgqe3a-py3.11\lib\site-packages (from pandas==2.2.2->my_krml_pine==2024.0.1.9) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\paiyn\appdata\local\pypoetry\cache\virtualenvs\kaggle1-nbadraft-risgqe3a-py3.11\lib\site-packages (from pandas==2.2.2->my_krml_pine==2024.0.1.9) (2024.1)
Requirement already satisfied: scipy>=1.6.0 in c:\users\paiyn\appdata\local\pypoetry\cache\virtualenvs\kaggle1-nbadraft-risgqe3a-py3.11\lib\site-packages (from scikit-learn==1.5.1->my_krml_pine==2024.0.1.9) (1.14.0)
Requirement already satisfied: joblib>=1.2.0 in c:\users\paiyn\appdata\local\pypoetry\cache\virtualenvs\kaggle1-nbadraft-risgqe3a-py3.11\lib\site-packages (from scikit-learn==1.5.1->my_krml_pine==2024.0.1.9) (1.4.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\users\paiyn\appdata\local\pypoetry\cache\virtualenvs\kaggle1-nbadraft-risgqe3a-py3.11\lib\site-packages (from scikit-learn==1.5.1->my_krml_pine==2024.0.1.9) (3.5.0)
Requirement already satisfied: six>=1.5 in c:\users\paiyn\appdata\local\pypoetry\cache\virtualenvs\kaggle1-nbadraft-risgqe3a-py3.11\lib\site-packages (from python-dateutil>=2.8.2->pandas==2.2.2->my_krml_pine==2024.0.1.9) (1.16.0)

## 2.2 import custom functions for data exploration

In [5]:
from my_krml_pine.data.dataexplorer import dataexplorer

## 2.3 Data Exploration using custom functions

In [6]:
# Create instances of DataExplorer
explorer = dataexplorer(df_train, df_test)

# Call the methods of the class to perform data exploration tasks on training and test datasets
explorer.display_shape()
explorer.display_columns()
explorer.display_info()
explorer.display_descriptive_stats()
explorer.display_no_of_duplicate_rows()
explorer.calculate_missing_percentage()

Shape of the training dataset:
Rows: 30490, Columns: 1547
Shape of the testing dataset:
Rows: 30490, Columns: 400
--------------------------------------------------------------------------------------------------------------
Columns of the training dataset:
Index(['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id', 'd_1',
       'd_2', 'd_3', 'd_4',
       ...
       'd_1532', 'd_1533', 'd_1534', 'd_1535', 'd_1536', 'd_1537', 'd_1538',
       'd_1539', 'd_1540', 'd_1541'],
      dtype='object', length=1547)
--------------------------------------------------------------------------------------------------------------
Columns of the testing dataset:
Index(['d_1542', 'd_1543', 'd_1544', 'd_1545', 'd_1546', 'd_1547', 'd_1548',
       'd_1549', 'd_1550', 'd_1551',
       ...
       'd_1932', 'd_1933', 'd_1934', 'd_1935', 'd_1936', 'd_1937', 'd_1938',
       'd_1939', 'd_1940', 'd_1941'],
      dtype='object', length=400)
--------------------------------------------------------------------------------------------------------------
Info about training dataset:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30490 entries, 0 to 30489
Columns: 1547 entries, id to d_1541
dtypes: int64(1541), object(6)
memory usage: 359.9+ MB
None
--------------------------------------------------------------------------------------------------------------
Info about testing dataset:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30490 entries, 0 to 30489
Columns: 400 entries, d_1542 to d_1941
dtypes: int64(400)
memory usage: 93.0 MB
None
--------------------------------------------------------------------------------------------------------------
Descriptive statistics of training dataset:
                d_1           d_2           d_3           d_4           d_5  \
count  30490.000000  30490.000000  30490.000000  30490.000000  30490.000000
mean       1.070220      1.041292      0.780026      0.833454      0.627944
std        5.126689      5.365468      3.667454      4.415141      3.379344
min        0.000000      0.000000      0.000000      0.000000      0.000000
25%        0.000000      0.000000      0.000000      0.000000      0.000000
50%        0.000000      0.000000      0.000000      0.000000      0.000000
75%        0.000000      0.000000      0.000000      0.000000      0.000000
max      360.000000    436.000000    207.000000    323.000000    296.000000

                d_6           d_7           d_8           d_9          d_10  \
count  30490.000000  30490.000000  30490.000000  30490.000000  30490.000000
mean       0.958052      0.918662      1.244080      1.073663      0.838701
std        4.785947      5.059495      6.617729      5.917204      4.206199
min        0.000000      0.000000      0.000000      0.000000      0.000000
25%        0.000000      0.000000      0.000000      0.000000      0.000000
50%        0.000000      0.000000      0.000000      0.000000      0.000000
75%        0.000000      0.000000      0.000000      0.000000      0.000000
max      314.000000    316.000000    370.000000    385.000000    353.000000

       ...        d_1532        d_1533        d_1534        d_1535  \
count  ...  30490.000000  30490.000000  30490.000000  30490.000000
mean   ...      1.129452      1.208691      1.484815      1.547393
std    ...      3.219694      3.276399      3.964839      4.086634
min    ...      0.000000      0.000000      0.000000      0.000000
25%    ...      0.000000      0.000000      0.000000      0.000000
50%    ...      0.000000      0.000000      0.000000      0.000000
75%    ...      1.000000      1.000000      2.000000      2.000000
max    ...     89.000000    128.000000    116.000000    131.000000

             d_1536        d_1537        d_1538        d_1539        d_1540  \
count  30490.000000  30490.000000  30490.000000  30490.000000  30490.000000
mean       1.131322      1.101902      1.137750      1.030863      1.084257
std        3.035784      3.751499      3.219956      2.957792      3.159583
min        0.000000      0.000000      0.000000      0.000000      0.000000
25%        0.000000      0.000000      0.000000      0.000000      0.000000
50%        0.000000      0.000000      0.000000      0.000000      0.000000
75%        1.000000      1.000000      1.000000      1.000000      1.000000
max       93.000000    299.000000    104.000000    129.000000    161.000000

             d_1541
count  30490.000000
mean       1.394424
std        3.922461
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max      192.000000

[8 rows x 1541 columns]
--------------------------------------------------------------------------------------------------------------
Descriptive statistics of testing dataset:
             d_1542        d_1543        d_1544        d_1545        d_1546  \
count  30490.000000  30490.000000  30490.000000  30490.000000  30490.000000
mean       1.454870      1.086192      0.991374      0.996458      1.005510
std        3.921289      2.874708      2.823429      2.784376      2.850691
min        0.000000      0.000000      0.000000      0.000000      0.000000
25%        0.000000      0.000000      0.000000      0.000000      0.000000
50%        0.000000      0.000000      0.000000      0.000000      0.000000
75%        1.000000      1.000000      1.000000      1.000000      1.000000
max      141.000000     84.000000    168.000000    127.000000    107.000000

             d_1547        d_1548        d_1549        d_1550        d_1551  \
count  30490.000000  30490.000000  30490.000000  30490.000000  30490.000000
mean       1.128993      1.429911      1.423614      1.096884      0.975730
std        3.143290      3.904518      3.826327      2.977056      2.678126
min        0.000000      0.000000      0.000000      0.000000      0.000000
25%        0.000000      0.000000      0.000000      0.000000      0.000000
50%        0.000000      0.000000      0.000000      0.000000      0.000000
75%        1.000000      2.000000      1.000000      1.000000      1.000000
max      130.000000    205.000000    139.000000    113.000000    119.000000

       ...        d_1932        d_1933        d_1934        d_1935  \
count  ...  30490.000000  30490.000000  30490.000000  30490.000000
mean   ...      1.445490      1.781174      1.965267      1.389374
std    ...      3.656824      4.426550      4.706284      3.313292
min    ...      0.000000      0.000000      0.000000      0.000000
25%    ...      0.000000      0.000000      0.000000      0.000000
50%    ...      0.000000      1.000000      1.000000      0.000000
75%    ...      2.000000      2.000000      2.000000      2.000000
max    ...    143.000000    156.000000    187.000000     98.000000

             d_1936        d_1937        d_1938        d_1939        d_1940  \
count  30490.000000  30490.000000  30490.000000  30490.000000  30490.000000
mean       1.271794      1.216661      1.212299      1.395605      1.689669
std        3.126178      3.000348      2.955910      3.514318      4.089208
min        0.000000      0.000000      0.000000      0.000000      0.000000
25%        0.000000      0.000000      0.000000      0.000000      0.000000
50%        0.000000      0.000000      0.000000      0.000000      1.000000
75%        1.000000      1.000000      1.000000      1.000000      2.000000
max       90.000000     77.000000     84.000000    110.000000    156.000000

             d_1941
count  30490.000000
mean       1.782158
std        4.284356
min        0.000000
25%        0.000000
50%        1.000000
75%        2.000000
max      117.000000

[8 rows x 400 columns]
--------------------------------------------------------------------------------------------------------------
No of duplicated rows in training dataset:
0
--------------------------------------------------------------------------------------------------------------
No of duplicated rows in testing dataset:
7
--------------------------------------------------------------------------------------------------------------
Percentage of missing values in each column in traning data:
Series([], dtype: float64)
Percentage of missing values in each column in test data:
Series([], dtype: float64)

## 2.5 Exploring meta data datasets

In [7]:
df_calendar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1969 entries, 0 to 1968
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      1969 non-null   object
 1   wm_yr_wk  1969 non-null   int64
 2   d         1969 non-null   object
dtypes: int64(1), object(2)
memory usage: 46.3+ KB

In [8]:
df_calendar.head()

         date  wm_yr_wk    d
0  2011-01-29     11101  d_1
1  2011-01-30     11101  d_2
2  2011-01-31     11101  d_3
3  2011-02-01     11101  d_4
4  2011-02-02     11101  d_5

In [9]:
df_cal_events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 167 entries, 0 to 166
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        167 non-null    object
 1   event_name  167 non-null    object
 2   event_type  167 non-null    object
dtypes: object(3)
memory usage: 4.0+ KB

In [10]:
df_calendar.head()

         date  wm_yr_wk    d
0  2011-01-29     11101  d_1
1  2011-01-30     11101  d_2
2  2011-01-31     11101  d_3
3  2011-02-01     11101  d_4
4  2011-02-02     11101  d_5

In [11]:
df_week_sell_price.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6841121 entries, 0 to 6841120
Data columns (total 4 columns):
 #   Column      Dtype
---  ------      -----
 0   store_id    object
 1   item_id     object
 2   wm_yr_wk    int64
 3   sell_price  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 208.8+ MB

In [12]:
df_week_sell_price.head()

  store_id        item_id  wm_yr_wk  sell_price
0     CA_1  HOBBIES_1_001     11325        9.58
1     CA_1  HOBBIES_1_001     11326        9.58
2     CA_1  HOBBIES_1_001     11327        8.26
3     CA_1  HOBBIES_1_001     11328        8.26
4     CA_1  HOBBIES_1_001     11329        8.26

# 3. Data Preperation

## 3.1 To integrate 'date' from 'calendar' and 'event type' from 'calendar_events' into the training and test datasets

In [13]:
# 1. Prepare the Date Mapping
# Replace inconsistent date separators (e.g., '-' with '/')
df_calendar['date'] = df_calendar['date'].str.replace('-', '/', regex=False)

# Doing some quick feature engineering from date field before merging
df_calendar['date'] = pd.to_datetime(df_calendar['date'], format='%Y/%m/%d',errors='coerce')
df_calendar['day_index'] = df_calendar['d'].str.extract('(\d+)').astype(int)
df_calendar['day_name'] = df_calendar['date'].dt.strftime('%a')
df_calendar['month_name'] = df_calendar['date'].dt.strftime('%b')

In [14]:
# 2. Melting the training data so that 'd_' columns become a single column
melted_train_data = pd.melt(df_train, 
                            id_vars=['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id'], 
                            var_name='d', 
                            value_name='sales')

# Now the 'd' column in melted_train_data corresponds to the 'd' column in calendar_data

# 3. Merging with the calendar data
merged_train_data = pd.merge(melted_train_data, df_calendar, on='d', how='left')

In [15]:
merged_train_data.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d,sales,date,wm_yr_wk,day_index,day_name,month
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,d_1,0,2011-01-29,11101,1,Saturday,1
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,d_1,0,2011-01-29,11101,1,Saturday,1
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,d_1,0,2011-01-29,11101,1,Saturday,1
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,d_1,0,2011-01-29,11101,1,Saturday,1
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,d_1,0,2011-01-29,11101,1,Saturday,1

In [16]:
# 4. Merging only the 'event_type' column based on 'date' from the 'calendar_events' meta data

#convert the date column in calendar events dataset
# Replace inconsistent date separators (e.g., '-' with '/')
df_cal_events['date'] = df_cal_events['date'].str.replace('-', '/', regex=False)

df_cal_events['date'] = pd.to_datetime(df_cal_events['date'], format='%Y/%m/%d',errors='coerce')

final_merged_train_data = pd.merge(merged_train_data, df_cal_events[['date', 'event_type']], on='date', how='left')

In [17]:
final_merged_train_data.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d,sales,date,wm_yr_wk,day_index,day_name,month,event_type
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,d_1,0,2011-01-29,11101,1,Saturday,1,NaN
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,d_1,0,2011-01-29,11101,1,Saturday,1,NaN
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,d_1,0,2011-01-29,11101,1,Saturday,1,NaN
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,d_1,0,2011-01-29,11101,1,Saturday,1,NaN
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,d_1,0,2011-01-29,11101,1,Saturday,1,NaN

In [18]:
# 5. Include the id columns into test dataset
#Extract the first 6 columns from the training dataset (these are the identifier columns)
id_cols = ['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id']
train_identifiers = df_train[id_cols]

# Combine the test dataset (which only has d_1542 to d_1941 columns) with the identifiers
# This ensures the test dataset gets the same structure as the training dataset
df_test_with_id = pd.concat([train_identifiers, df_test], axis=1)

# Verify the new structure
print(df_test_with_id.head())

                              id        item_id    dept_id   cat_id store_id  \
0  HOBBIES_1_001_CA_1_evaluation  HOBBIES_1_001  HOBBIES_1  HOBBIES     CA_1
1  HOBBIES_1_002_CA_1_evaluation  HOBBIES_1_002  HOBBIES_1  HOBBIES     CA_1
2  HOBBIES_1_003_CA_1_evaluation  HOBBIES_1_003  HOBBIES_1  HOBBIES     CA_1
3  HOBBIES_1_004_CA_1_evaluation  HOBBIES_1_004  HOBBIES_1  HOBBIES     CA_1
4  HOBBIES_1_005_CA_1_evaluation  HOBBIES_1_005  HOBBIES_1  HOBBIES     CA_1

  state_id  d_1542  d_1543  d_1544  d_1545  ...  d_1932  d_1933  d_1934  \
0       CA       0       1       0       2  ...       2       4       0
1       CA       0       0       0       0  ...       0       1       2
2       CA       0       0       0       0  ...       1       0       2
3       CA       4       1       0       1  ...       1       1       0
4       CA       3       0       0       1  ...       0       0       0

   d_1935  d_1936  d_1937  d_1938  d_1939  d_1940  d_1941
0       0       0       0       3       3       0       1
1       1       1       0       0       0       0       0
2       0       0       0       2       3       0       1
3       4       0       1       3       0       2       6
4       2       1       0       0       2       1       0

[5 rows x 406 columns]

In [19]:
# 6. Melting the test data so that 'd_' columns become a single column
melted_test_data = pd.melt(df_test_with_id, 
                            id_vars=['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id'], 
                            var_name='d', 
                            value_name='sales')

# Now the 'd' column in melted_test_data corresponds to the 'd' column in calendar_data

# 7. Merging with the calendar data
merged_test_data = pd.merge(melted_test_data, df_calendar, on='d', how='left')

In [20]:
merged_test_data.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d,sales,date,wm_yr_wk,day_index,day_name,month
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,0,2015-04-19,11512,1542,Sunday,4
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,0,2015-04-19,11512,1542,Sunday,4
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,0,2015-04-19,11512,1542,Sunday,4
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,4,2015-04-19,11512,1542,Sunday,4
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,3,2015-04-19,11512,1542,Sunday,4

In [21]:
# 8. Merging only the 'event_type' column based on 'date' from the 'calendar_events' meta data

final_merged_test_data = pd.merge(merged_test_data, df_cal_events[['date', 'event_type']], on='date', how='left')

In [22]:
final_merged_test_data.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d,sales,date,wm_yr_wk,day_index,day_name,month,event_type
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,0,2015-04-19,11512,1542,Sunday,4,NaN
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,0,2015-04-19,11512,1542,Sunday,4,NaN
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,0,2015-04-19,11512,1542,Sunday,4,NaN
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,4,2015-04-19,11512,1542,Sunday,4,NaN
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,3,2015-04-19,11512,1542,Sunday,4,NaN

In [23]:
final_merged_train_data.shape

(47107050, 14)

In [24]:
final_merged_test_data.shape

(12196000, 14)

In [25]:
# Display unique values of the 'event_type' column
unique_event_types = final_merged_test_data['event_type'].unique()

# Print the unique values
print(unique_event_types)

[nan 'Cultural' 'National' 'Sporting' 'Religious']

In [26]:
# Display unique values of the 'event_type' column
unique_event_types1 = final_merged_train_data['event_type'].unique()

# Print the unique values
print(unique_event_types1)

[nan 'Sporting' 'Cultural' 'National' 'Religious']

In [27]:
# 9. Replace missing values in event_type feature
final_merged_test_data['event_type'] = final_merged_test_data['event_type'].fillna('No Event')
final_merged_train_data['event_type'] = final_merged_train_data['event_type'].fillna('No Event')

## 3.2 Merge the sales price into training and test datasets and create the target variable 'sales_revenue'

In [28]:
#Merging the final dataset with price meta data
price_merged_test_data = pd.merge(final_merged_test_data, df_week_sell_price, on=['store_id', 'item_id', 'wm_yr_wk'])
price_merged_train_data = pd.merge(final_merged_train_data, df_week_sell_price, on=['store_id', 'item_id', 'wm_yr_wk'])

# Calculate sales revenue
price_merged_test_data['sales_revenue'] = price_merged_test_data['sales'] * price_merged_test_data['sell_price']
price_merged_train_data['sales_revenue'] = price_merged_train_data['sales'] * price_merged_train_data['sell_price']

In [29]:
price_merged_train_data.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d,sales,date,wm_yr_wk,day_index,day_name,month,event_type,sell_price,sales_revenue
0,HOBBIES_1_008_CA_1_evaluation,HOBBIES_1_008,HOBBIES_1,HOBBIES,CA_1,CA,d_1,12,2011-01-29,11101,1,Saturday,1,No Event,0.46,5.52
1,HOBBIES_1_009_CA_1_evaluation,HOBBIES_1_009,HOBBIES_1,HOBBIES,CA_1,CA,d_1,2,2011-01-29,11101,1,Saturday,1,No Event,1.56,3.12
2,HOBBIES_1_010_CA_1_evaluation,HOBBIES_1_010,HOBBIES_1,HOBBIES,CA_1,CA,d_1,0,2011-01-29,11101,1,Saturday,1,No Event,3.17,0.00
3,HOBBIES_1_012_CA_1_evaluation,HOBBIES_1_012,HOBBIES_1,HOBBIES,CA_1,CA,d_1,0,2011-01-29,11101,1,Saturday,1,No Event,5.98,0.00
4,HOBBIES_1_015_CA_1_evaluation,HOBBIES_1_015,HOBBIES_1,HOBBIES,CA_1,CA,d_1,4,2011-01-29,11101,1,Saturday,1,No Event,0.70,2.80

In [30]:
price_merged_test_data.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d,sales,date,wm_yr_wk,day_index,day_name,month,event_type,sell_price,sales_revenue
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,0,2015-04-19,11512,1542,Sunday,4,No Event,8.26,0.00
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,0,2015-04-19,11512,1542,Sunday,4,No Event,3.97,0.00
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,0,2015-04-19,11512,1542,Sunday,4,No Event,2.97,0.00
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,4,2015-04-19,11512,1542,Sunday,4,No Event,4.64,18.56
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,d_1542,3,2015-04-19,11512,1542,Sunday,4,No Event,2.88,8.64

## 3.3 Saving the intermediate results in the data folder

In [31]:
# Training data
price_merged_train_data.to_parquet('../data/interim/price_merged_train_data.parquet', index=False, engine='pyarrow')

# Testing data
price_merged_test_data.to_parquet('../data/interim/price_merged_test_data.parquet', index=False, engine='pyarrow')

## 3.4 Handling missing data

In [32]:
# Create instances of DataExplorer
explorer = dataexplorer(price_merged_train_data, price_merged_test_data)

# Call the methods of the class to perform data exploration tasks on training and test datasets
explorer.display_shape()
explorer.display_columns()
explorer.display_info()
explorer.display_descriptive_stats()
explorer.display_no_of_duplicate_rows()
explorer.calculate_missing_percentage()

Shape of the training dataset:
Rows: 34815174, Columns: 16
Shape of the testing dataset:
Rows: 12160986, Columns: 16
--------------------------------------------------------------------------------------------------------------
Columns of the training dataset:
Index(['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id', 'd',
       'sales', 'date', 'wm_yr_wk', 'day_index', 'day_name', 'month',
       'event_type', 'sell_price', 'sales_revenue'],
      dtype='object')
--------------------------------------------------------------------------------------------------------------
Columns of the testing dataset:
Index(['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id', 'd',
       'sales', 'date', 'wm_yr_wk', 'day_index', 'day_name', 'month',
       'event_type', 'sell_price', 'sales_revenue'],
      dtype='object')
--------------------------------------------------------------------------------------------------------------
Info about training dataset:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34815174 entries, 0 to 34815173
Data columns (total 16 columns):
 #   Column         Dtype
---  ------         -----
 0   id             object
 1   item_id        object
 2   dept_id        object
 3   cat_id         object
 4   store_id       object
 5   state_id       object
 6   d              object
 7   sales          int64
 8   date           datetime64[ns]
 9   wm_yr_wk       int64
 10  day_index      int64
 11  day_name       object
 12  month          int32
 13  event_type     object
 14  sell_price     float64
 15  sales_revenue  float64
dtypes: datetime64[ns](1), float64(2), int32(1), int64(3), object(9)
memory usage: 4.0+ GB
None
--------------------------------------------------------------------------------------------------------------
Info about testing dataset:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12160986 entries, 0 to 12160985
Data columns (total 16 columns):
 #   Column         Dtype
---  ------         -----
 0   id             object
 1   item_id        object
 2   dept_id        object
 3   cat_id         object
 4   store_id       object
 5   state_id       object
 6   d              object
 7   sales          int64
 8   date           datetime64[ns]
 9   wm_yr_wk       int64
 10  day_index      int64
 11  day_name       object
 12  month          int32
 13  event_type     object
 14  sell_price     float64
 15  sales_revenue  float64
dtypes: datetime64[ns](1), float64(2), int32(1), int64(3), object(9)
memory usage: 1.4+ GB
None
--------------------------------------------------------------------------------------------------------------
Descriptive statistics of training dataset:
              sales                           date      wm_yr_wk  \
count  3.481517e+07                       34815174  3.481517e+07
mean   1.470858e+00  2013-06-20 00:48:04.492326912  1.131627e+04
min    0.000000e+00            2011-01-29 00:00:00  1.110100e+04
25%    0.000000e+00            2012-07-12 00:00:00  1.122400e+04
50%    0.000000e+00            2013-08-03 00:00:00  1.132800e+04
75%    1.000000e+00            2014-06-26 00:00:00  1.142100e+04
max    7.630000e+02            2015-04-18 00:00:00  1.151200e+04
std    4.514397e+00                            NaN  1.169680e+02

          day_index         month    sell_price  sales_revenue
count  3.481517e+07  3.481517e+07  3.481517e+07   3.481517e+07
mean   8.740334e+02  6.370181e+00  4.383812e+00   4.102582e+00
min    1.000000e+00  1.000000e+00  1.000000e-02   0.000000e+00
25%    5.310000e+02  3.000000e+00  2.080000e+00   0.000000e+00
50%    9.180000e+02  6.000000e+00  3.440000e+00   0.000000e+00
75%    1.245000e+03  9.000000e+00  5.840000e+00   4.850000e+00
max    1.541000e+03  1.200000e+01  1.073200e+02   2.164320e+03
std    4.290742e+02  3.488934e+00  3.358256e+00   1.046314e+01
--------------------------------------------------------------------------------------------------------------
Descriptive statistics of testing dataset:
              sales                           date      wm_yr_wk  \
count  1.216099e+07                       12160986  1.216099e+07
mean   1.304800e+00  2015-11-04 20:44:02.275749888  1.155399e+04
min    0.000000e+00            2015-04-19 00:00:00  1.151200e+04
25%    0.000000e+00            2015-07-28 00:00:00  1.152600e+04
50%    0.000000e+00            2015-11-05 00:00:00  1.154000e+04
75%    1.000000e+00            2016-02-13 00:00:00  1.160300e+04
max    3.490000e+02            2016-05-22 00:00:00  1.161700e+04
std    3.615884e+00                            NaN  3.607392e+01

          day_index         month    sell_price  sales_revenue
count  1.216099e+07  1.216099e+07  1.216099e+07   1.216099e+07
mean   1.741864e+03  6.355108e+00  4.482624e+00   4.042860e+00
min    1.542000e+03  1.000000e+00  5.000000e-02   0.000000e+00
25%    1.642000e+03  4.000000e+00  2.240000e+00   0.000000e+00
50%    1.742000e+03  6.000000e+00  3.480000e+00   0.000000e+00
75%    1.842000e+03  9.000000e+00  5.880000e+00   4.700000e+00
max    1.941000e+03  1.200000e+01  3.588000e+01   1.585620e+03
std    1.153828e+02  3.347897e+00  3.538461e+00   1.131369e+01
--------------------------------------------------------------------------------------------------------------
No of duplicated rows in training dataset:
0
--------------------------------------------------------------------------------------------------------------
No of duplicated rows in testing dataset:
0
--------------------------------------------------------------------------------------------------------------
Percentage of missing values in each column in traning data:
Series([], dtype: float64)
Percentage of missing values in each column in test data:
Series([], dtype: float64)

*** No missing values - So no action was taken